tap "homebrew/bundle"
tap "ngrok/ngrok"
tap "pulumi/tap"
tap "redis/redis"
# Use AWS IAM credentials to authenticate to Kubernetes
brew "aws-iam-authenticator"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Official Amazon AWS command-line interface
brew "awscli"
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Kubernetes package manager
brew "helm"
# Command-line benchmarking tool
brew "hyperfine"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Production Grade K8s Installation, Upgrades, and Management
brew "kops"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Kubernetes controller and tool for one-way encrypted Secrets
brew "kubeseal"
# Postgres C API library
brew "libpq"
# Run a Kubernetes cluster locally
brew "minikube"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Manage multiple Node.js versions
brew "nvm"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Tools for Multiple Arcade Machine Emulator
brew "rom-tools"
# Terminal multiplexer
brew "tmux"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Web Assembly Binary Toolkit
brew "wabt"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# Pulumi - Modern Infrastructure as Code. Any cloud, any language 
brew "pulumi/tap/pulumi"
# Export photos from Apple Photos app and query the Photos database
brew "rhettbull/osxphotos/osxphotos"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Application launcher and productivity software
cask "alfred"
# Antivirus software
cask "avast-security"
# Managed client-based VPN service to securely access AWS resources
cask "aws-vpn-client"
# Web browser focusing on privacy
cask "brave-browser"
# Open source IDE for exploring and testing APIs
cask "bruno"
# Terminal-based AI coding assistant
cask "claude-code"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Brings the power of Copilot coding agent directly to your terminal
cask "copilot-cli"
# Voice and text chat software
cask "discord"
# Developer platform
cask "dotnet-sdk"
# Security audit software
cask "drata-agent"
# Online diagram software
cask "drawio"
# Client for the Dropbox cloud storage service
cask "dropbox@beta"
cask "font-maple-mono-nf"
cask "font-roboto-mono-nerd-font"
# Free and open-source image editor
cask "gimp"
# Web browser
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# App to manage software development and track bugs
cask "linear-linear"
# Native app email client for Gmail
cask "mimestream"
# Interactive tool for analyzing MongoDB data
cask "mongodb-compass"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Replacement for Docker Desktop
cask "orbstack"
# GUI client for PostgreSQL databases
cask "postico"
# Redis is an in-memory database that persists on disk. The data model is key-value, but many different kind of values are supported: Strings, Lists, Sets, Sorted Sets, Hashes, Streams, HyperLogLogs, Bitmaps.
cask "redis/redis/redis"
# Team communication and collaboration software
cask "slack"
# Text editor for code, markup and prose
cask "sublime-text"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# Open-source code editor
cask "visual-studio-code"
# Open-source code editor
cask "visual-studio-code@insiders"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Gecko based web browser
cask "zen@twilight"
vscode "adamhartford.vscode-base64"
vscode "bruno-api-client.bruno"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "eriklynd.json-tools"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "flesler.url-encode"
vscode "foxundermoon.shell-format"
vscode "github.vscode-pull-request-github"
vscode "gurumukhi.selected-lines-count"
vscode "humao.rest-client"
vscode "johnpapa.vscode-peacock"
vscode "johnpapa.winteriscoming"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-ossdata.vscode-pgsql"
vscode "ms-playwright.playwright"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.vscode-speech"
vscode "nrwl.angular-console"
vscode "openai.chatgpt"
vscode "prisma.prisma"
vscode "redhat.vscode-xml"
vscode "renesaarsoo.sql-formatter-vsc"
vscode "sdras.night-owl"
vscode "snowflake.snowflake-vsc"
vscode "swellaby.workspace-config-plus"
vscode "tamasfe.even-better-toml"
vscode "typescriptteam.native-preview"
vscode "vstirbu.vscode-mermaid-preview"
vscode "yoavbls.pretty-ts-errors"
