tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "mutagen-io/mutagen"
tap "remind101/formulae"
brew "aws-iam-authenticator"
brew "awscli"
brew "guile"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "pinentry"
brew "gnupg"
brew "go"
brew "helm"
brew "jq"
brew "kops"
brew "kubectx"
brew "kubernetes-cli@1.22"
brew "kubeseal"
brew "minikube"
brew "moreutils"
brew "nvm"
brew "openssl@3"
brew "pinentry-mac"
brew "pipx"
brew "pulumi"
brew "pyenv"
brew "python@3.9"
brew "socat"
brew "yq"
brew "zsh"
brew "zsh-completions"
brew "mutagen-io/mutagen/mutagen-compose"
cask "alfred"
cask "avast-security"
cask "azure-data-studio-insiders"
cask "brave-browser"
cask "discord"
cask "docker"
cask "dotnet-sdk"
cask "drawio"
cask "dropbox-beta"
cask "firefox-developer-edition"
cask "font-roboto-mono-nerd-font"
cask "gimp"
cask "google-chrome"
cask "iterm2"
cask "mimestream"
cask "mongodb-compass"
cask "ngrok"
cask "postman"
cask "slack"
cask "steam"
cask "sublime-text"
cask "visual-studio-code"
cask "xquartz"
