tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

brew "aws-iam-authenticator"
brew "awscli"
brew "gnupg"
brew "go"
brew "helm"
brew "jq"
brew "kops"
brew "kubectx"
brew "kubernetes-cli"
brew "kubeseal"
brew "minikube"
brew "moreutils"
brew "nvm"
brew "openssl@3"
brew "pinentry"
brew "pinentry-mac"
brew "pipx"
brew "pulumi"
brew "pyenv"
brew "python@3.9"
brew "yq"
brew "zsh-completions"

cask "1password"
cask "alfred"
cask "avast-security"
cask "aws-vpn-client"
cask "docker"
cask "dotnet-sdk"
cask "drata-agent"
cask "drawio"
cask "dropbox-beta"
cask "firefox-developer-edition"
cask "font-roboto-mono-nerd-font"
cask "gimp"
cask "google-chrome"
cask "iterm2"
cask "microsoft-remote-desktop"
cask "mimestream"
cask "mongodb-compass"
cask "postico"
cask "postman"
cask "slack"
cask "sublime-text"
cask "visual-studio-code-insiders"
cask "xquartz"
